ir_version: 3
producer_name: "OnnxMLTools"
producer_version: "0.1.0.0000"
domain: "onnxml"
model_version: 0
doc_string: ""
graph {
  node {
    input: "1"
    output: "1.1"
    name: "Scaler"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "3"
    output: "3.1"
    name: "Scaler.1"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "2"
    output: "2.1"
    name: "Scaler.2"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "5"
    output: "5.1"
    name: "Scaler.3"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "4"
    output: "4.1"
    name: "Scaler.4"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "7"
    output: "7.1"
    name: "Scaler.5"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "6"
    output: "6.1"
    name: "Scaler.6"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "8"
    output: "8.1"
    name: "Scaler.7"
    op_type: "Scaler"
    attribute {
      name: "scale"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "offset"
      floats: 0.0
      type: FLOATS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "1.1"
    input: "3.1"
    input: "2.1"
    input: "5.1"
    input: "4.1"
    input: "7.1"
    input: "6.1"
    input: "8.1"
    output: "__feature_vector__"
    name: "FV"
    op_type: "FeatureVectorizer"
    attribute {
      name: "inputdimensions"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.TargetIndex"
    output: "__OHE_0__"
    name: "AFE"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_0__"
    output: "__OHE_0__.1"
    name: "OHE"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.1.TargetIndex"
    output: "__OHE_1__"
    name: "AFE.1"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_1__"
    output: "__OHE_1__.1"
    name: "OHE.1"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 0
      ints: 1
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.2.TargetIndex"
    output: "__OHE_2__"
    name: "AFE.2"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_2__"
    output: "__OHE_2__.1"
    name: "OHE.2"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      ints: 5
      ints: 6
      ints: 7
      ints: 8
      ints: 9
      ints: 10
      ints: 11
      ints: 12
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.3.TargetIndex"
    output: "__OHE_3__"
    name: "AFE.3"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_3__"
    output: "__OHE_3__.1"
    name: "OHE.3"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 0
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      ints: 5
      ints: 6
      ints: 7
      ints: 8
      ints: 9
      ints: 10
      ints: 11
      ints: 12
      ints: 13
      ints: 14
      ints: 15
      ints: 16
      ints: 17
      ints: 18
      ints: 19
      ints: 20
      ints: 21
      ints: 22
      ints: 23
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.4.TargetIndex"
    output: "__OHE_4__"
    name: "AFE.4"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_4__"
    output: "__OHE_4__.1"
    name: "OHE.4"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 0
      ints: 1
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.5.TargetIndex"
    output: "__OHE_5__"
    name: "AFE.5"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_5__"
    output: "__OHE_5__.1"
    name: "OHE.5"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 0
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      ints: 5
      ints: 6
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.6.TargetIndex"
    output: "__OHE_6__"
    name: "AFE.6"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_6__"
    output: "__OHE_6__.1"
    name: "OHE.6"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 0
      ints: 1
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__feature_vector__"
    input: "AFE.7.TargetIndex"
    output: "__OHE_7__"
    name: "AFE.7"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_7__"
    output: "__OHE_7__.1"
    name: "OHE.7"
    op_type: "OneHotEncoder"
    attribute {
      name: "cats_int64s"
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  node {
    input: "__OHE_0__.1"
    input: "__OHE_1__.1"
    input: "__OHE_2__.1"
    input: "__OHE_3__.1"
    input: "__OHE_4__.1"
    input: "__OHE_5__.1"
    input: "__OHE_6__.1"
    input: "__OHE_7__.1"
    output: "transformed_features"
    name: "FV.1"
    op_type: "FeatureVectorizer"
    attribute {
      name: "inputdimensions"
      ints: 4
      ints: 2
      ints: 12
      ints: 24
      ints: 2
      ints: 7
      ints: 2
      ints: 4
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  name: "coreml_OneHotEncoder_BikeSharing"
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 0
    name: "AFE.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 1
    name: "AFE.1.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 2
    name: "AFE.2.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 3
    name: "AFE.3.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 4
    name: "AFE.4.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 5
    name: "AFE.5.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 6
    name: "AFE.6.TargetIndex"
  }
  initializer {
    dims: 1
    data_type: INT64
    int64_data: 7
    name: "AFE.7.TargetIndex"
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "transformed_features"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 57
          }
        }
      }
    }
  }
}
opset_import {
  domain: "ai.onnx.ml"
  version: 1
}
