ir_version: 3
producer_name: "OnnxMLTools"
producer_version: "0.1.0.0000"
domain: "onnxconverter-common"
model_version: 0
doc_string: ""
graph {
  node {
    input: "input1"
    output: "Transpose"
    name: "Transpose"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Transpose"
    output: "flatten_1_output"
    name: "Flatten"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "flatten_1_output"
    input: "FC.W"
    input: "FC.b"
    output: "output1"
    name: "FC"
    op_type: "FC"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "axis_w"
      i: 1
      type: INT
    }
    domain: ""
  }
  name: "keras2coreml_Dense_ImageNet_small"
  initializer {
    dims: 2
    dims: 27
    data_type: FLOAT
    float_data: -0.4337746202945709
    float_data: -0.3899373710155487
    float_data: 0.4487854838371277
    float_data: 0.04028040170669556
    float_data: -0.4077050983905792
    float_data: 0.15725499391555786
    float_data: -0.10571610927581787
    float_data: -0.20952019095420837
    float_data: 0.2955973148345947
    float_data: -0.2520023584365845
    float_data: -0.3800058364868164
    float_data: 0.10715943574905396
    float_data: 0.36334115266799927
    float_data: 0.09528756141662598
    float_data: 0.2985154390335083
    float_data: 0.1681334376335144
    float_data: -0.2382999062538147
    float_data: 0.045745909214019775
    float_data: -0.2949361205101013
    float_data: 0.025732576847076416
    float_data: 0.4511229395866394
    float_data: -0.08628731966018677
    float_data: -0.18781358003616333
    float_data: 0.21829843521118164
    float_data: -0.06133955717086792
    float_data: 0.35264331102371216
    float_data: -0.16864582896232605
    float_data: 0.22914928197860718
    float_data: -0.4194830656051636
    float_data: -0.18751025199890137
    float_data: 0.25380194187164307
    float_data: 0.273565411567688
    float_data: -0.30769824981689453
    float_data: 0.19837546348571777
    float_data: -0.03992101550102234
    float_data: -0.24879322946071625
    float_data: -0.33208122849464417
    float_data: 0.06280326843261719
    float_data: 0.24583935737609863
    float_data: -0.16895923018455505
    float_data: 0.36857640743255615
    float_data: -0.40191587805747986
    float_data: 0.4532207250595093
    float_data: 0.13023853302001953
    float_data: -0.23050139844417572
    float_data: -0.3252599239349365
    float_data: 0.34873247146606445
    float_data: -0.3637743592262268
    float_data: 0.4523831009864807
    float_data: 0.003692924976348877
    float_data: -0.019962221384048462
    float_data: 0.21565717458724976
    float_data: 0.19266080856323242
    float_data: -0.2635895013809204
    name: "FC.W"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    float_data: 0.0
    float_data: 0.0
    name: "FC.b"
  }
  input {
    name: "input1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_param: "None"
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "output1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_param: "None"
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 1
}
